Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Клиенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИсторияЗаписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗаписей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МедицинскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Клиенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура МедицинскаяКартаНаСервере(Клиент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияЗаписей.Период КАК Период,
		|	ИсторияЗаписей.Регистратор КАК Регистратор,
		|	ИсторияЗаписей.Сотрудник КАК Сотрудник,
		|	ИсторияЗаписей.Услуга КАК Услуга,
		|	ИсторияЗаписей.Сумма КАК Сумма
		|ИЗ
		|	РегистрСведений.ИсторияЗаписей КАК ИсторияЗаписей
		|ГДЕ
		|	ИсторияЗаписей.Клиент = &Клиент
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияЗаписей.Регистратор,
		|	ИсторияЗаписей.Период,
		|	ИсторияЗаписей.Сотрудник,
		|	ИсторияЗаписей.Услуга,
		|	ИсторияЗаписей.Сумма";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("123");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура МедицинскаяКарта(Команда)
	//МедицинскаяКартаНаСервере(Объект.Ссылка);
	
	ПечатьМедицинскойКарты(Объект.Ссылка);
КонецПроцедуры 

&НаСервере
Процедура ПечатьМедицинскойКарты(Клиент)
	Макет = Справочники.Клиенты.ПолучитьМакет("МедКарта");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияЗаписей.Период КАК Период,
		|	ИсторияЗаписей.Регистратор КАК Регистратор,
		|	ИсторияЗаписей.Сотрудник КАК Сотрудник,
		|	ИсторияЗаписей.Услуга КАК Услуга,
		|	ИсторияЗаписей.Сумма КАК Сумма,
		|	ИсторияЗаписей.Клиент КАК Клиент
		|ИЗ
		|	РегистрСведений.ИсторияЗаписей КАК ИсторияЗаписей
		|ГДЕ
		|	ИсторияЗаписей.Клиент = &Клиент
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияЗаписей.Регистратор,
		|	ИсторияЗаписей.Период,
		|	ИсторияЗаписей.Сотрудник,
		|	ИсторияЗаписей.Услуга,
		|	ИсторияЗаписей.Сумма,
		|	ИсторияЗаписей.Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокЗаписи = Макет.ПолучитьОбласть("ЗаголовокЗаписи");
	ОбластьСтрокаЗаписи = Макет.ПолучитьОбласть("СтрокаЗаписи");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	ОбластьШапка.Параметры.Клиент = Клиент.Наименование;
	ОбластьШапка.Параметры.ДатаРождения = Формат(Клиент.ДатаРождения, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьШапка);
	
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовокЗаписи.Параметры.ЗаписьНаименование = "Запись №" + Выборка.Регистратор.Номер;
		ТабДок.Вывести(ОбластьЗаголовокЗаписи);
		
		ОбластьСтрокаЗаписи.Параметры.Дата = Выборка.Период;
		ОбластьСтрокаЗаписи.Параметры.Услуга = Выборка.Услуга.Наименование;
		ОбластьСтрокаЗаписи.Параметры.Сумма = Выборка.Сумма;
		ОбластьСтрокаЗаписи.Параметры.Сотрудник = Выборка.Сотрудник.Наименование;
		ТабДок.Вывести(ОбластьСтрокаЗаписи);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.РаботаСФайлами
	ГиперссылкаФайлов = РаботаСФайлами.ГиперссылкаФайлов();
	ГиперссылкаФайлов.Размещение = "Файлы";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	ПечатьМедицинскойКарты(Объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайламиКонецПроцедуры 
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами
// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)

	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами
